voucher-client/docs/voucher.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3.1-hudson-749-SNAPSHOT. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3.1-hudson-749-SNAPSHOT. -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
    xmlns:tns="http://voucher.smarttv.dk/" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns="http://schemas.xmlsoap.org/wsdl/" 
    targetNamespace="http://voucher.smarttv.dk/" 
    name="voucherService">
    <ns1:Policy xmlns:ns1="http://www.w3.org/ns/ws-policy" wsu:Id="voucherInterfacePortBinding_consumeTicket_WSAT_Policy">
        <ns1:ExactlyOne>
            <ns1:All>
                <ns2:ATAlwaysCapability xmlns:ns2="http://schemas.xmlsoap.org/ws/2004/10/wsat"></ns2:ATAlwaysCapability>
                <ns3:ATAssertion xmlns:ns4="http://schemas.xmlsoap.org/ws/2002/12/policy" xmlns:ns3="http://schemas.xmlsoap.org/ws/2004/10/wsat" ns1:Optional="true" ns4:Optional="true"></ns3:ATAssertion>
            </ns1:All>
        </ns1:ExactlyOne>
    </ns1:Policy>
    <types>
        <xsd:schema>
            <xsd:import namespace="http://voucher.smarttv.dk/" schemaLocation="schema.xsd"></xsd:import>
        </xsd:schema>
    </types>
    <message name="consumeTicket">
        <part name="arg0" type="tns:vodTransactionRequestObject"></part>
    </message>
    <message name="consumeTicketResponse">
        <part name="return" type="tns:vodTransactionReplyObject"></part>
    </message>
    <portType name="voucherInterface">
        <operation name="consumeTicket">
            <input message="tns:consumeTicket"></input>
            <output message="tns:consumeTicketResponse"></output>
        </operation>
    </portType>
    <binding name="voucherInterfacePortBinding" type="tns:voucherInterface">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"></soap:binding>
        <operation name="consumeTicket">
            <ns5:PolicyReference xmlns:ns5="http://www.w3.org/ns/ws-policy" URI="#voucherInterfacePortBinding_consumeTicket_WSAT_Policy"></ns5:PolicyReference>
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal" namespace="http://voucher.smarttv.dk/"></soap:body>
            </input>
            <output>
                <soap:body use="literal" namespace="http://voucher.smarttv.dk/"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="voucherService">
        <port name="voucherInterfacePort" binding="tns:voucherInterfacePortBinding">
            <soap:address location="http://194.239.10.119:8080/voucherService/voucherInterface"></soap:address>
        </port>
    </service>
</definitions>